newsletter_02_02_2019.html
<!doctype html>
<html lang="en">
<head>
<title>Les algorithmes sont-ils neutres ?</title>
<!-- 2019-02-02 Sat 15:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Laurent Garnier">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Les algorithmes sont-ils neutres ?</h1>



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> La lettre</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Salutations</h3>
<div class="outline-text-3" id="text-1-1">

<h1>Pour ne rien rater de mon actu</h1>
<form action="https://laurentgarnier.podia.com/email_lists/20100/subscriptions" accept-charset="UTF-8" method="post"><input name="utf8" type="hidden" value="✓" />
<input type="email" name="email" required="required" placeholder="Email" />
<input type="submit" value="Sign me up!" />
</form>
	
<p>
Bonjour toi,
</p>

<p>
tu ne sais peut-être pas ce qu'est un algorithme ? 
</p>



<p>
Ou alors au contraire tu penses que parce que tu les connais trop
bien cette question te paraît infondée.
</p>


<p>
Il y a quelques jours j'ai fait un petit tour rapide sur la face de
bouc&#x2026; ça faisait presque un an que je n'y étais pas allé&#x2026;
</p>


<p>
Et crois-moi, je m'en portais plutôt bien.
</p>



<p>
Seulement voilà, on m'a
partagé <a href="https://www.franceculture.fr/emissions/la-methode-scientifique/cathy-oneil-pour-une-ethique-des-algorithmes?fbclid=IwAR1NYGNbKTKf0Z5VvWJyhwcfTH0aV0Q86-f1Yn7r4nyyO8TaQcn0W9qSKAg"
	   target="_blank">ça</a> !
</p>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Point culture</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Cathy O'Neil avec ses cheveux multi-colores (ok je juge, mais en
général les dégradés de couleurs de ce style sont inversement
proportionnels au QI qui les porte)&#x2026; ben malgré ses cheveux
multi-colores je dois reconnaître qu'elle pose une vraie question
très pertinente.
</p>


<p>
La dame en question est data scientist, elle est passée par le MIT
et Columbia&#x2026; bref, elle a quelques connaissances utiles pour
questionner le sujet.
</p>


<p>
Son raisonnement rejoint peu ou prou celui de notre Science4All
national dans sa série sur
les <a href="https://www.youtube.com/watch?v=DrjkjPVf7Bw&amp;list=PLtzmb84AoqRTl0m1b82gVLcGU38miqdrC"
       target="_blank">IA</a>.
</p>
</div>
</div>



<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Analyse</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Tu n'es pas obligé de faire math sup pour comprendre le problème.
</p>


<p>
Il est rare qu'un individu développe des valeurs radicalement
différentes de celles de son environnement.
</p>


<p>
Bien sûr tu peux toujours exhiber des exceptions, mais
statistiquement (voir Bourdieu) on assiste à des reproductions de
classes.
</p>
</div>
</div>



<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Retour au réel</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Il est où le rapport avec les algos ?
</p>


<p>
Les algorithmes les plus utilisés actuellement (FB, YT, Netflix&#x2026;)
sont des algorithmes d'apprentissage automatique.
</p>


<p>
Le fameux machine learning ou deep learning revient à entraîner les
machines à partir de jeux de données choisis par des humains. 
</p>


<p>
Et oui, le problème ne vient pas des machines mais des humains qui
les éduquent directement ou indirectement.
</p>


<p>
Je vais pas épiloguer ici mais si ça t'intéresse de mieux
comprendre comment fonctionnent les algorithmes de machine learning
il suffit de le dire.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Encouragements</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Dans cette vidéo <a href="https://youtu.be/YPZvA8NjjuM" target="_blank">https://youtu.be/YPZvA8NjjuM</a> non seulement je
poursuis la réalisation de mes résolutions mes en plus je te
propose une petite colle en probabilité.
</p>


<p>
Voilà c'est tout pour aujourd'hui (en cadeau bonus en pièce jointe
je te mets le pdf et le html de la newsletter d'hier). 
</p>


<p>
Chaque jour est une occasion de devenir meilleur.
</p>
</div>
</div>


<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Motivation</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Qu'as-tu fait aujourd'hui de mieux qu'hier ? 
Dis-moi en répondant à ce mail.
</li>

<li>Qu'est-ce que tu aimerais améliorer dans ta vie ? 
Dis-moi en répondant à ce mail.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Aide</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Ne lâche pas l'affaire pour tes projets. 
</p>


<p>
Tu peux réussir à tenir tes résolutions si tu t'en donnes les
moyens et je peux t'y aider si tu en as envie. 
</p>


<p>
Si ça t'intéresse il te suffit de répondre à ce mail pour me faire
savoir tes disponibilités. 
</p>
</div>
</div>





<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Fin et partage</h3>
<div class="outline-text-3" id="text-1-8">
<p>
C'est tout pour aujourd'hui.
</p>


<p>
PS : si tu lis cette lettre c'est que tu fais partie de mon club
privé et du coup tu peux faire un acte généreux en la partageant
autour de toi (par mail et/ou via les réseaux sociaux et asociaux)
afin que les personnes qui souhaitent s'améliorer puissent
s'inscrire en cliquant ici :
<a href="http://cours-laurent.systeme.io/investis-en-toi" target="_blank">http://cours-laurent.systeme.io/investis-en-toi</a>
</p>

<p>
PPS : s'il y a un sujet que tu aimerais que je traite dis-le en
répondant à cette lettre.
</p>


<p>
N'oublie pas, chaque jour est une occasion de devenir meilleur.
</p>

<p>
Chaque jour je travaille pour vous apporter toujours plus de valeur
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Où trouver cette lettre ?</h2>
<div class="outline-text-2" id="text-2">
  <ul class="org-ul">
    <li>
      Sur <a href="https://emacsfreeman.github.io/ccp/newsletter_02_02_2019.html"
	     target="_blank">GitHub</a> :
      <ol>
	<li>
	  Celle du jour :
	  <a href="https://emacsfreeman.github.io/ccp/newsletter_02_02_2019.html"
	     target="_blank">https://emacsfreeman.github.io/ccp/newsletter_02_02_2019.html</a>
	</li>
	<li>
	  Celle d'hier :
	  <a href="https://emacsfreeman.github.io/ccp/newsletter_01_02_2019.html"
	     target="_blank">https://emacsfreeman.github.io/ccp/newsletter_01_02_2019.html</a>
	</li>
      </ol>
      
    </li>
    <li>
      Sur <a href="https://steemit.com/algorithmes/@lgsp/les-algorithmes-sont-ils-neutres"
	     target="_blank">Steemit</a> :
      <ol>
	<li>
	  Celle du jour :
	  <a href="https://steemit.com/algorithmes/@lgsp/les-algorithmes-sont-ils-neutres"
	     target="_blank">https://steemit.com/algorithmes/@lgsp/les-algorithmes-sont-ils-neutres
	</li>
	<li>
	  Celle d'hier :
	  <a href="https://steemit.com/newsletter/@lgsp/l-annee-commence-en-fevrier"
	     target="_blank">https://steemit.com/newsletter/@lgsp/l-annee-commence-en-fevrier</a>
	</li>
      </ol>
    </li>
  </ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Les outils de code</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> L'outil magique pour faire ça</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://github.com/marsmining/ox-twbs" target="_blank">https://github.com/marsmining/ox-twbs</a>
</li>
<li>la commande magique : <code>org-twbs-export-to-html</code>
</li>
<li>mes tutos pour faire ses premiers pas
  avec <a href="https://www.youtube.com/playlist?list=PLUJNJAesbJGWi3dXmGljFTXCPt-ntQFco"
	  target="_blank">org</a>
  et <a href="https://www.youtube.com/playlist?list=PLUJNJAesbJGXZHtC_bTUOCwB_qkfbdHpZ"
  target="_blank">emacs</a>
</li>
</ul>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. La lettre</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Salutations</a></li>
<li><a href="#sec-1-2">1.2. Point culture</a></li>
<li><a href="#sec-1-3">1.3. Analyse</a></li>
<li><a href="#sec-1-4">1.4. Retour au réel</a></li>
<li><a href="#sec-1-5">1.5. Encouragements</a></li>
<li><a href="#sec-1-6">1.6. Motivation</a></li>
<li><a href="#sec-1-7">1.7. Aide</a></li>
<li><a href="#sec-1-8">1.8. Fin et partage</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Où trouver cette lettre ?</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Sur GitHub</a></li>
<li><a href="#sec-2-2">2.2. Sur Steemit</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Les outils de code</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. L'outil magique pour faire ça</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Laurent Garnier</p>
<p class="date">Created: 2019-02-02 Sat 15:14</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="http://orgmode.org">Org-mode</a> 9.1.13)</p>
</div>
</footer>
</body>
</html>
