newsletter_02_02_2019.tex
% Created 2019-02-02 Sat 16:03
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\hypersetup{colorlinks = true}
\usetheme{default}
\author{Laurent Garnier}
\date{\today}
\title{Les algorithmes sont-ils neutres ?}
\hypersetup{
 pdfauthor={Laurent Garnier},
 pdftitle={Les algorithmes sont-ils neutres ?},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.13)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}



\section{La lettre}
\label{sec:orga8fff79}
\begin{frame}[label={sec:org185e6e5}]{Salutations}
Bonjour toi,

tu ne sais peut-être pas ce qu'est un algorithme ? 



Ou alors au contraire tu penses que parce que tu les connais trop
bien cette question te paraît infondée.


Il y a quelques jours j'ai fait un petit tour rapide sur la face de
bouc\ldots{} ça faisait presque un an que je n'y étais pas allé\ldots{}


Et crois-moi, je m'en portais plutôt bien.



Seulement voilà, on m'a partagé \href{https://www.franceculture.fr/emissions/la-methode-scientifique/cathy-oneil-pour-une-ethique-des-algorithmes?fbclid=IwAR1NYGNbKTKf0Z5VvWJyhwcfTH0aV0Q86-f1Yn7r4nyyO8TaQcn0W9qSKAg}{ça} !
\end{frame}


\begin{frame}[label={sec:org7ee95de}]{Point culture}
Cathy O'Neil avec ses cheveux multi-colores (ok je juge, mais en
général les dégradés de couleurs de ce style sont inversement
proportionnels au QI qui les porte)\ldots{} ben malgré ses cheveux
multi-colores je dois reconnaître qu'elle pose une vraie question
très pertinente.


La dame en question est data scientist, elle est passée par le MIT
et Columbia\ldots{} bref, elle a quelques connaissances utiles pour
questionner le sujet.


Son raisonnement rejoint peu ou prou celui de notre Science4All
national dans sa série sur les \href{https://www.youtube.com/watch?v=DrjkjPVf7Bw\&list=PLtzmb84AoqRTl0m1b82gVLcGU38miqdrC}{IA}.
\end{frame}



\begin{frame}[label={sec:org537f20c}]{Analyse}
Tu n'es pas obligé de faire math sup pour comprendre le problème.


Il est rare qu'un individu développe des valeurs radicalement
différentes de celles de son environnement.


Bien sûr tu peux toujours exhiber des exceptions, mais
statistiquement (voir Bourdieu) on assiste à des reproductions de
classes.
\end{frame}



\begin{frame}[label={sec:orgf743a49}]{Retour au réel}
Il est où le rapport avec les algos ?


Les algorithmes les plus utilisés actuellement (FB, YT, Netflix\ldots{})
sont des algorithmes d'apprentissage automatique.


Le fameux machine learning ou deep learning revient à entraîner les
machines à partir de jeux de données choisis par des humains. 


Et oui, le problème ne vient pas des machines mais des humains qui
les éduquent directement ou indirectement.


Je vais pas épiloguer ici mais si ça t'intéresse de mieux
comprendre comment fonctionnent les algorithmes de machine learning
il suffit de le dire.
\end{frame}

\begin{frame}[label={sec:orga6db3c1}]{Encouragements}
Dans cette vidéo \url{https://youtu.be/YPZvA8NjjuM} non seulement je
poursuis la réalisation de mes résolutions mes en plus je te
propose une petite colle en probabilité.


Voilà c'est tout pour aujourd'hui (en cadeau bonus en pièce jointe
je te mets le pdf et le html de la newsletter d'hier). 


Chaque jour est une occasion de devenir meilleur.
\end{frame}


\begin{frame}[label={sec:org9ba8989}]{Motivation}
\begin{itemize}
\item Qu'as-tu fait aujourd'hui de mieux qu'hier ? 
Dis-moi en répondant à ce mail.

\item Qu'est-ce que tu aimerais améliorer dans ta vie ? 
Dis-moi en répondant à ce mail.
\end{itemize}
\end{frame}


\begin{frame}[label={sec:org8cb42f1}]{Aide}
Ne lâche pas l'affaire pour tes projets. 


Tu peux réussir à tenir tes résolutions si tu t'en donnes les
moyens et je peux t'y aider si tu en as envie. 


Si ça t'intéresse il te suffit de répondre à ce mail pour me faire
savoir tes disponibilités. 
\end{frame}





\begin{frame}[label={sec:org813b1c4}]{Fin et partage}
C'est tout pour aujourd'hui.


PS : si tu lis cette lettre c'est que tu fais partie de mon club
privé et du coup tu peux faire un acte généreux en la partageant
autour de toi (par mail et/ou via les réseaux sociaux et asociaux)
afin que les personnes qui souhaitent s'améliorer puissent
s'inscrire en cliquant ici :
\url{http://cours-laurent.systeme.io/investis-en-toi}

PPS : s'il y a un sujet que tu aimerais que je traite dis-le en
répondant à cette lettre.


N'oublie pas, chaque jour est une occasion de devenir meilleur.

Chaque jour je travaille pour vous apporter toujours plus de valeur
\end{frame}

\section{Où trouver cette lettre ?}
\label{sec:orgb68d777}
\begin{frame}[label={sec:orga7fb369}]{Sur GitHub}
\begin{enumerate}
\item Celle du jour :
\url{https://emacsfreeman.github.io/ccp/newsletter\_02\_02\_2019.html}

\item Celle d'hier :
\url{https://emacsfreeman.github.io/ccp/newsletter\_01\_02\_2019.html}
\end{enumerate}
\end{frame}

\begin{frame}[label={sec:orgf518f17}]{Sur Steemit}
\begin{enumerate}
\item Celle du jour :
\url{https://steemit.com/algorithmes/@lgsp/les-algorithmes-sont-ils-neutres}

\item Celle d'hieur :
\url{https://steemit.com/newsletter/@lgsp/l-annee-commence-en-fevrier}
\end{enumerate}
\end{frame}

\section{Les outils de code}
\label{sec:org29ce28c}
\begin{frame}[fragile,label={sec:orgbf2c0b7}]{L'outil magique pour faire ça}
 \begin{itemize}
\item \url{https://github.com/marsmining/ox-twbs}
\item la commande magique : \texttt{org-twbs-export-to-html}
\item mes tutos pour faire ses premiers pas avec \href{https://www.youtube.com/playlist?list=PLUJNJAesbJGWi3dXmGljFTXCPt-ntQFco}{org} et \href{https://www.youtube.com/playlist?list=PLUJNJAesbJGXZHtC\_bTUOCwB\_qkfbdHpZ}{emacs}
\end{itemize}
\end{frame}
\end{document}